# Basic

In [2]:
import pandas as pd

In [2]:
color = pd.Series(['빨강', '파랑', '노랑'])
color

0    빨강
1    파랑
2    노랑
dtype: object

In [3]:
price = pd.Series([1000, 2000, 3000])
price

0    1000
1    2000
2    3000
dtype: int64

In [27]:
tone = pd.Series([10, 20, 30])
tone

0    10
1    20
2    30
dtype: int64

In [28]:
df = pd.DataFrame({
    '색상' : color,
    '가격' : price,
    '톤' : tone
})

df

   색상    가격   톤
0  빨강  1000  10
1  파랑  2000  20
2  노랑  3000  30

In [11]:
# Series 형태로 선택하는 경우 []
type(df['색상'])

pandas.core.series.Series

In [13]:
# DataFrame 형태로 선택하는 경우
type(df)

pandas.core.frame.DataFrame

In [10]:
# DataFrame 형태로 선택하는 경우 [[]]
type(df[['색상']])

pandas.core.frame.DataFrame

In [12]:
# DataFrame 형태로 선택하는 경우 [[]]
type(df[['색상', '가격']])

pandas.core.frame.DataFrame

In [29]:
df.to_csv('test.csv', index=False) # index = False 하지 않으면 index를 별도의 컬럼으로 또 저장함(Unnamed)

In [30]:
df2 = pd.read_csv('test.csv')
df2.head() # 앞부터

   색상    가격   톤
0  빨강  1000  10
1  파랑  2000  20
2  노랑  3000  30

In [31]:
df.tail(2) # 마지막

   색상    가격   톤
1  파랑  2000  20
2  노랑  3000  30

In [23]:
df.sample(2) # 랜덤 추출

   색상    가격
0  빨강  1000
1  파랑  2000

In [24]:
df.shape # (행, 열)

(3, 2)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   색상      3 non-null      object
 1   가격      3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [32]:
df.corr(numeric_only=True)

     가격    톤
가격  1.0  1.0
톤   1.0  1.0

In [34]:
df.nunique()

색상    3
가격    3
톤     3
dtype: int64

In [36]:
df['톤'].unique()

array([10, 20, 30])

In [38]:
df['톤'].value_counts() # s 주의

톤
10    1
20    1
30    1
Name: count, dtype: int64

In [39]:
df.describe()

           가격     톤
count     3.0   3.0
mean   2000.0  20.0
std    1000.0  10.0
min    1000.0  10.0
25%    1500.0  15.0
50%    2000.0  20.0
75%    2500.0  25.0
max    3000.0  30.0

In [42]:
df.describe(include='O')

        색상
count    3
unique   3
top     빨강
freq     1

In [9]:
data = {
    "메뉴": ['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격": [4500.0, 5000.0, 5500.0, 5000.0, 4000.0, 5900.0, 5300.0],
    "칼로리": ['10', '110', '250', '110', '20', '210', '0'],
}
df = pd.DataFrame(data)
df.head()

      메뉴      가격  칼로리
0  아메리카노  4500.0   10
1   카페라떼  5000.0  110
2   카페모카  5500.0  250
3   카푸치노  5000.0  110
4  에스프레소  4000.0   20

In [10]:
df.to_csv('cafe.csv', index=False)

In [11]:
df = pd.read_csv('cafe.csv')
df.head()

      메뉴      가격  칼로리
0  아메리카노  4500.0   10
1   카페라떼  5000.0  110
2   카페모카  5500.0  250
3   카푸치노  5000.0  110
4  에스프레소  4000.0   20

In [12]:
df['new'] = 0
df.head()

      메뉴      가격  칼로리  new
0  아메리카노  4500.0   10    0
1   카페라떼  5000.0  110    0
2   카페모카  5500.0  250    0
3   카푸치노  5000.0  110    0
4  에스프레소  4000.0   20    0

In [13]:
df['할인가'] = df['가격'] * 0.8
df.head()

      메뉴      가격  칼로리  new     할인가
0  아메리카노  4500.0   10    0  3600.0
1   카페라떼  5000.0  110    0  4000.0
2   카페모카  5500.0  250    0  4400.0
3   카푸치노  5000.0  110    0  4000.0
4  에스프레소  4000.0   20    0  3200.0

In [14]:
df = df.drop(0, axis=0)
df.head()

      메뉴      가격  칼로리  new     할인가
1   카페라떼  5000.0  110    0  4000.0
2   카페모카  5500.0  250    0  4400.0
3   카푸치노  5000.0  110    0  4000.0
4  에스프레소  4000.0   20    0  3200.0
5    밀크티  5900.0  210    0  4720.0

In [16]:
df = df.drop('칼로리', axis=1)
df.head()

      메뉴      가격  new     할인가
1   카페라떼  5000.0    0  4000.0
2   카페모카  5500.0    0  4400.0
3   카푸치노  5000.0    0  4000.0
4  에스프레소  4000.0    0  3200.0
5    밀크티  5900.0    0  4720.0

In [17]:
df.head()

      메뉴      가격  new     할인가
1   카페라떼  5000.0    0  4000.0
2   카페모카  5500.0    0  4400.0
3   카푸치노  5000.0    0  4000.0
4  에스프레소  4000.0    0  3200.0
5    밀크티  5900.0    0  4720.0

In [28]:
df.loc[1] # 0은 존재하는 index가 지워져서 조회 불가

메뉴       카페라떼
가격     5000.0
new         0
할인가    4000.0
Name: 1, dtype: object

In [29]:
df.iloc[1] # 순서로 조회

메뉴       카페모카
가격     5500.0
new         0
할인가    4400.0
Name: 2, dtype: object

In [32]:
df.loc[1, '가격']

np.float64(5000.0)

In [37]:
df.loc[:, '가격']

1    5000.0
2    5500.0
3    5000.0
4    4000.0
5    5900.0
6    5300.0
Name: 가격, dtype: float64

In [35]:
df.iloc[0, 1]

np.float64(5000.0)

In [38]:
df.loc[2:3, 'new':'할인가']

   new     할인가
2    0  4400.0
3    0  4000.0

In [41]:
df.iloc[1:3, 1:]

       가격  new     할인가
2  5500.0    0  4400.0
3  5000.0    0  4000.0

In [42]:
df.loc[1]

메뉴       카페라떼
가격     5000.0
new         0
할인가    4000.0
Name: 1, dtype: object

In [43]:
df.loc[:, '가격']

1    5000.0
2    5500.0
3    5000.0
4    4000.0
5    5900.0
6    5300.0
Name: 가격, dtype: float64

In [45]:
df.loc[2, '가격':'할인가']

가격     5500.0
new         0
할인가    4400.0
Name: 2, dtype: object

In [46]:
df.loc[2, ['가격', '할인가']]

가격     5500.0
할인가    4400.0
Name: 2, dtype: object

In [48]:
df.iloc[0]

메뉴       카페라떼
가격     5000.0
new         0
할인가    4000.0
Name: 1, dtype: object

In [55]:
df.iloc[:, 1]

1    5000.0
2    5500.0
3    5000.0
4    4000.0
5    5900.0
6    5300.0
Name: 가격, dtype: float64

In [59]:
df.iloc[0:2, 1:3]

       가격  new
1  5000.0    0
2  5500.0    0

In [60]:
import numpy as np

In [114]:
df = pd.read_csv('cafe.csv')

In [78]:
df['원산지'] = None
df.head()

      메뉴      가격  칼로리   원산지
0  아메리카노  4500.0   10  None
1   카페라떼  5000.0  110  None
2   카페모카  5500.0  250  None
3   카푸치노  5000.0  110  None
4  에스프레소  4000.0   20  None

In [79]:
df.loc[0, '원산지'] = '콩고'
df.iloc[1, 3] = '과테말라'
df.head()

      메뉴      가격  칼로리   원산지
0  아메리카노  4500.0   10    콩고
1   카페라떼  5000.0  110  과테말라
2   카페모카  5500.0  250  None
3   카푸치노  5000.0  110  None
4  에스프레소  4000.0   20  None

In [80]:
df.loc['시즌'] = ['사이다', 1000, 50, '서울']
df.tail()

       메뉴      가격  칼로리   원산지
3    카푸치노  5000.0  110  None
4   에스프레소  4000.0   20  None
5     밀크티  5900.0  210  None
6      녹차  5300.0    0  None
시즌    사이다  1000.0   50    서울

In [81]:
df.loc[7] = ['사이다', 1000, 50, '서울']
df.tail()

       메뉴      가격  칼로리   원산지
4   에스프레소  4000.0   20  None
5     밀크티  5900.0  210  None
6      녹차  5300.0    0  None
시즌    사이다  1000.0   50    서울
7     사이다  1000.0   50    서울

In [82]:
df.loc[8] = {'메뉴' : '얼박사', '가격' : 3500}
df.tail()

     메뉴      가격    칼로리   원산지
5   밀크티  5900.0  210.0  None
6    녹차  5300.0    0.0  None
시즌  사이다  1000.0   50.0    서울
7   사이다  1000.0   50.0    서울
8   얼박사  3500.0    NaN   NaN

In [85]:
df = df.drop('시즌', axis=0)
df.tail()

KeyError: "['시즌'] not found in axis"

In [121]:
df.to_csv('cafe2.csv', index=False)

In [102]:
pd.read_csv('cafe2.csv')

      메뉴      가격    칼로리   원산지
0  아메리카노  4500.0   10.0    콩고
1   카페라떼  5000.0  110.0  과테말라
2   카페모카  5500.0  250.0   NaN
3   카푸치노  5000.0  110.0   NaN
4  에스프레소  4000.0   20.0   NaN
5    밀크티  5900.0  210.0   NaN
6     녹차  5300.0    0.0   NaN
7    사이다  1000.0   50.0    서울
8    얼박사  3500.0    NaN   NaN

In [ ]:
df.sort_index(ascending=False)

      메뉴      가격    칼로리   원산지
8    얼박사  3500.0    NaN   NaN
7    사이다  1000.0   50.0    서울
6     녹차  5300.0    0.0   NaN
5    밀크티  5900.0  210.0   NaN
4  에스프레소  4000.0   20.0   NaN
3   카푸치노  5000.0  110.0   NaN
2   카페모카  5500.0  250.0   NaN
1   카페라떼  5000.0  110.0  과테말라
0  아메리카노  4500.0   10.0    콩고

In [ ]:
df.sort_values('가격') # 기본값은 오름차(True)

      메뉴      가격    칼로리   원산지
7    사이다  1000.0   50.0    서울
8    얼박사  3500.0    NaN   NaN
4  에스프레소  4000.0   20.0   NaN
0  아메리카노  4500.0   10.0    콩고
1   카페라떼  5000.0  110.0  과테말라
3   카푸치노  5000.0  110.0   NaN
6     녹차  5300.0    0.0   NaN
2   카페모카  5500.0  250.0   NaN
5    밀크티  5900.0  210.0   NaN

In [103]:
df = df.sort_values(['가격', '칼로리'], ascending=[True, False])
df

      메뉴      가격    칼로리   원산지
7    사이다  1000.0   50.0    서울
8    얼박사  3500.0    NaN   NaN
4  에스프레소  4000.0   20.0   NaN
0  아메리카노  4500.0   10.0    콩고
3   카푸치노  5000.0  110.0   NaN
1   카페라떼  5000.0  110.0  과테말라
6     녹차  5300.0    0.0   NaN
2   카페모카  5500.0  250.0   NaN
5    밀크티  5900.0  210.0   NaN

In [ ]:
df.reset_index(drop=False)

   index     메뉴      가격    칼로리   원산지
0      7    사이다  1000.0   50.0    서울
1      8    얼박사  3500.0    NaN   NaN
2      4  에스프레소  4000.0   20.0   NaN
3      0  아메리카노  4500.0   10.0    콩고
4      3   카푸치노  5000.0  110.0   NaN
5      1   카페라떼  5000.0  110.0  과테말라
6      6     녹차  5300.0    0.0   NaN
7      2   카페모카  5500.0  250.0   NaN
8      5    밀크티  5900.0  210.0   NaN

In [113]:
df = df.reset_index(drop=True) # 꼬인 index를 제거
df

0    False
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
Name: 가격, dtype: bool

In [ ]:
cond = df['가격'] > 5000 # 조건을 변수화해서 사용하는 것 권장(결과 True/False)
#df[df['가격'] > 3000]
#df[~cond]
df[cond]

     메뉴      가격  칼로리
2  카페모카  5500.0  250
5   밀크티  5900.0  210
6    녹차  5300.0    0

In [134]:
cond1 = df['가격'] > 3000
cond2 = df['칼로리'] > 100
df[cond1 & cond2]

     메뉴      가격  칼로리
1  카페라떼  5000.0  110
2  카페모카  5500.0  250
3  카푸치노  5000.0  110
5   밀크티  5900.0  210

In [135]:
df[cond1 | cond2]

      메뉴      가격  칼로리
0  아메리카노  4500.0   10
1   카페라떼  5000.0  110
2   카페모카  5500.0  250
3   카푸치노  5000.0  110
4  에스프레소  4000.0   20
5    밀크티  5900.0  210
6     녹차  5300.0    0

In [144]:
cond1 = df['메뉴'] == '녹차'
cond2 = df['가격'] > 6000
# df[(df['메뉴'] == '녹차') &  (df['가격'] > 5000)] => 이렇게 할꺼면 () 처리로 묶어줘야 연산자 우선순위 문제 x
df[cond1 & cond2]

Empty DataFrame
Columns: [메뉴, 가격, 칼로리]
Index: []

In [147]:
menus = ['녹차', '밀크티']
cond = df['메뉴'].isin(menus)
df[cond]

    메뉴      가격  칼로리
5  밀크티  5900.0  210
6   녹차  5300.0    0

In [165]:
df = pd.read_csv('cafe2.csv')
df['원산지'] = None
df

      메뉴      가격  칼로리   원산지
0  아메리카노  4500.0   10  None
1   카페라떼  5000.0  110  None
2   카페모카  5500.0  250  None
3   카푸치노  5000.0  110  None
4  에스프레소  4000.0   20  None
5    밀크티  5900.0  210  None
6     녹차  5300.0    0  None

In [168]:
df.loc[0, '원산지'] = '콩고'
df.iloc[1, 3] = '케냐'

In [169]:
df

      메뉴      가격  칼로리   원산지
0  아메리카노  4500.0   10    콩고
1   카페라떼  5000.0  110    케냐
2   카페모카  5500.0  250  None
3   카푸치노  5000.0  110  None
4  에스프레소  4000.0   20  None
5    밀크티  5900.0  210  None
6     녹차  5300.0    0  None

In [170]:
df['원산지'] = df['원산지'].fillna('한국') # 그냥 df로 대입하면 전체가 한국으로 바뀜

In [171]:
df

      메뉴      가격  칼로리 원산지
0  아메리카노  4500.0   10  콩고
1   카페라떼  5000.0  110  케냐
2   카페모카  5500.0  250  한국
3   카푸치노  5000.0  110  한국
4  에스프레소  4000.0   20  한국
5    밀크티  5900.0  210  한국
6     녹차  5300.0    0  한국

In [173]:
df.to_csv('cafe3.csv', index=False)

In [189]:
df = pd.read_csv('cafe3.csv')

In [181]:
df = df.replace('아메리카노', '루왁')
df

      메뉴      가격  칼로리 원산지
0     루왁  4500.0   10  콩고
1   카페라떼  5000.0  110  케냐
2   카페모카  5500.0  250  한국
3   카푸치노  5000.0  110  한국
4  에스프레소  4000.0   20  한국
5    밀크티  5900.0  210  한국
6     녹차  5300.0    0  한국

In [183]:
df.loc[6, '원산지'] = '일본'
df

      메뉴      가격  칼로리 원산지
0     루왁  4500.0   10  콩고
1   카페라떼  5000.0  110  케냐
2   카페모카  5500.0  250  한국
3   카푸치노  5000.0  110  한국
4  에스프레소  4000.0   20  한국
5    밀크티  5900.0  210  한국
6     녹차  5300.0    0  일본

In [190]:
df.loc[1:2, '이벤트가'] = 2000
df

      메뉴      가격  칼로리 원산지    이벤트가
0  아메리카노  4500.0   10  콩고     NaN
1   카페라떼  5000.0  110  케냐  2000.0
2   카페모카  5500.0  250  한국  2000.0
3   카푸치노  5000.0  110  한국     NaN
4  에스프레소  4000.0   20  한국     NaN
5    밀크티  5900.0  210  한국     NaN
6     녹차  5300.0    0  한국     NaN

In [191]:
df.to_csv('cafe4.csv', index=False)

In [194]:
df = pd.read_csv('cafe4.csv')
df

      메뉴      가격  칼로리 원산지    이벤트가
0  아메리카노  4500.0   10  콩고     NaN
1   카페라떼  5000.0  110  케냐  2000.0
2   카페모카  5500.0  250  한국  2000.0
3   카푸치노  5000.0  110  한국     NaN
4  에스프레소  4000.0   20  한국     NaN
5    밀크티  5900.0  210  한국     NaN
6     녹차  5300.0    0  한국     NaN

In [196]:
mapping = {'한국' : '국산'}
df['신토불이'] = df['원산지'].map(mapping)
df

      메뉴      가격  칼로리 원산지    이벤트가 신토불이
0  아메리카노  4500.0   10  콩고     NaN  NaN
1   카페라떼  5000.0  110  케냐  2000.0  NaN
2   카페모카  5500.0  250  한국  2000.0   국산
3   카푸치노  5000.0  110  한국     NaN   국산
4  에스프레소  4000.0   20  한국     NaN   국산
5    밀크티  5900.0  210  한국     NaN   국산
6     녹차  5300.0    0  한국     NaN   국산

In [215]:
df = pd.DataFrame({
    'A': ['데이터 분석', '기본 학습서', '퇴근 후 열공'],
    'B': [10, 20, 30],
    'C': ['ab cd', 'AB CD', 'ab cd']
})

df

         A   B      C
0   데이터 분석  10  ab cd
1   기본 학습서  20  AB CD
2  퇴근 후 열공  30  ab cd

In [ ]:
df['A'] = df['A'].str.replace('분석', '시각화') # str이 없으면 전체가 일치해야 바뀜(숫자에 적용하면 오류 발생 주의)

In [205]:
df

         A   B      C
0  데이터 시각화  10  ab cd
1   기본 학습서  20  AB CD
2  퇴근 후 열공  30  ab cd

In [208]:
df['A'].str.split().str[0]

0    데이터
1     기본
2     퇴근
Name: A, dtype: object

In [209]:
df['A'].str.contains('데이터')

0     True
1    False
2    False
Name: A, dtype: bool

In [210]:
df

         A   B      C
0  데이터 시각화  10  ab cd
1   기본 학습서  20  AB CD
2  퇴근 후 열공  30  ab cd

In [218]:
df['C'] = df['C'].str.lower()
df['C'] = df['C'].str.replace(" ", "")
df

         A   B     C
0   데이터 분석  10  abcd
1   기본 학습서  20  abcd
2  퇴근 후 열공  30  abcd

In [ ]:
df['C'].str[1:3] # str 써줘야 일부 추출 없으면 그냥 행을 추출함

0    bc
1    bc
2    bc
Name: C, dtype: object

In [222]:
df.shape

(3, 3)

In [234]:
df = pd.read_csv('cafe4.csv')

In [241]:
cond = df['가격'] > 5000
len(df[cond])
sum(cond)

3

In [245]:
df.sum(numeric_only=True)

가격      35200.0
칼로리       710.0
이벤트가     4000.0
dtype: float64

In [247]:
df

      메뉴      가격  칼로리 원산지    이벤트가
0  아메리카노  4500.0   10  콩고     NaN
1   카페라떼  5000.0  110  케냐  2000.0
2   카페모카  5500.0  250  한국  2000.0
3   카푸치노  5000.0  110  한국     NaN
4  에스프레소  4000.0   20  한국     NaN
5    밀크티  5900.0  210  한국     NaN
6     녹차  5300.0    0  한국     NaN

In [ ]:
df.sum(axis=1, numeric_only=True) # sum은 1이 행(drop은 0이 행)

0    4510.0
1    7110.0
2    7750.0
3    5110.0
4    4020.0
5    6110.0
6    5300.0
dtype: float64

In [254]:
cond = df['가격'] > df['가격'].quantile(.90)
df[cond]

    메뉴      가격  칼로리 원산지  이벤트가
5  밀크티  5900.0  210  한국   NaN

In [258]:
df['원산지'].mode()[0]

'한국'

In [263]:
maxidx = df['가격'].idxmax() # 가장 큰 값의 index 반환
df.loc[maxidx]

메뉴         밀크티
가격      5900.0
칼로리        210
원산지         한국
이벤트가       NaN
Name: 5, dtype: object

In [264]:
def cal(x):
    if x >= 100:
        return 'over'
    else:
        return 'under'
    
df['초과'] = df['칼로리'].apply(cal)
df

      메뉴      가격  칼로리 원산지    이벤트가     초과
0  아메리카노  4500.0   10  콩고     NaN  under
1   카페라떼  5000.0  110  케냐  2000.0   over
2   카페모카  5500.0  250  한국  2000.0   over
3   카푸치노  5000.0  110  한국     NaN   over
4  에스프레소  4000.0   20  한국     NaN  under
5    밀크티  5900.0  210  한국     NaN   over
6     녹차  5300.0    0  한국     NaN  under

In [265]:
df = pd.DataFrame({
    'Name': {0: '퀵카', 1: '알파카', 2: '시바견'},
    '수학': {0: 90, 1: 93, 2: 85},
    '영어': {0: 92, 1: 84, 2: 86},
    '국어': {0: 91, 1: 94, 2: 83},
})

df

  Name  수학  영어  국어
0   퀵카  90  92  91
1  알파카  93  84  94
2  시바견  85  86  83

In [266]:
pd.melt(df, id_vars=['Name'])

  Name variable  value
0   퀵카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   퀵카       영어     92
4  알파카       영어     84
5  시바견       영어     86
6   퀵카       국어     91
7  알파카       국어     94
8  시바견       국어     83

In [267]:
pd.melt(df, id_vars=['Name'], value_vars=['수학', '영어'])

  Name variable  value
0   퀵카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   퀵카       영어     92
4  알파카       영어     84
5  시바견       영어     86

In [270]:
pd.melt(df, id_vars=['Name'], var_name='과목', value_name='점수')

  Name  과목  점수
0   퀵카  수학  90
1  알파카  수학  93
2  시바견  수학  85
3   퀵카  영어  92
4  알파카  영어  84
5  시바견  영어  86
6   퀵카  국어  91
7  알파카  국어  94
8  시바견  국어  83